testsuite/test-buildStencil/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "simulationParameter"

convertToMeters 1;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 3 0)
    (0 3 0)
    (0 0 3)
    (3 0 3)
    (3 3 3)
    (0 3 3)
);

blocks
(
    //hex (0 1 2 3 4 5 6 7) (3 3 1) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) ($nx $nx $nx) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    right
    {
        type wall;
        faces
        (

            (1 2 6 5)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 3 7 6)
        );
    }
    front
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
